jmharvey1/ESP32S3_CW_Machine/src/main.cpp
      }
      

      /*the following 2 flags were added for LVGL support to manage the use of
      the 'ADCread_disp_refr_timer_mutx' Semaphore*/
      bool rdy = false;
      bool relseSemphr = false;
      ret = adc_continuous_read(adc_handle, result, Goertzel_SAMPLE_CNT * SOC_ADC_DIGI_RESULT_BYTES, &ret_num, 0);
      if (ret == ESP_OK)
      {
        if (SlwFlg)
          FrstPass = false; // 20231231 added to support new 4ms sample interval, W/ 8ms dataset
        if (FrstPass)
        {
          // InitGoertzel(cur_smpl_rate);
          ResetGoertzel();
        }
        if (SlwFlg && !FrstPass)
          offset = Goertzel_SAMPLE_CNT;
        else
          offset = 0;

        /*  ESP_LOGI("TASK_ADC", "ret is %x, ret_num is %"PRIu32" bytes", ret, ret_num);*/
        if (CWsndengn.IsActv() && CWsndengn.GetSOTflg())
        {
          if (xSemaphoreTake(ADCread_disp_refr_timer_mutx, pdMS_TO_TICKS(3)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
          {
            rdy = true;
            relseSemphr = true;
          }
        }
        else
          rdy = true;
        if (rdy)
        {
          for (int i = 0; i < Goertzel_SAMPLE_CNT / 2; i++) // for (int i = 0; i < ret_num; i += SOC_ADC_DIGI_RESULT_BYTES)
          {
            /*Used this approach because I found the ADC data were being returned in alternating order.
            So by taking them a pair at a time,I could restore (& process them) in their true chronological order
            BUT for the Sharewave ESP32S3, it appears that the data sample pairs don't need to be reversed*/
            int pos0 = 2 * i;
            int pos1 = pos0 + 1;
            adc_digi_output_data_t *p0 = (adc_digi_output_data_t *)&result[pos0 * SOC_ADC_DIGI_RESULT_BYTES];
            adc_digi_output_data_t *p1 = (adc_digi_output_data_t *)&result[pos1 * SOC_ADC_DIGI_RESULT_BYTES];
            k = ((int)(p0->type2.data) - BIAS);     // for esp32s3 changed from type1 to type2 & samples are added in 'normal' order
            addSmpl(k, pos0 + offset, &Smpl_CntrA); // addSmpl(k, pos1, &Smpl_CntrA);
            k = ((int)(p1->type2.data) - BIAS);     // for esp32s3 changed from type1 to type2 & samples are added in 'normal' order
            addSmpl(k, pos1 + offset, &Smpl_CntrA); // addSmpl(k, pos0, &Smpl_CntrA);
          }
        }
        /* We have finished accessing the shared resource.  Release the
             semaphore. */
        if (relseSemphr)
          xSemaphoreGive(ADCread_disp_refr_timer_mutx);

#ifdef POSTADC
        skip1 = true;

        if (!skip1)
        {
#endif          
          /*logic to manage the number of data samples to take before going on to compute goertzel magnitudes*/
          // if(SlwFlg && FrstPass){
          //   FrstPass = false;
          // } else if(SlwFlg){
          //   FrstPass = true;
          // }
          if (SlwFlg && FrstPass)
          {
            FrstPass = false;
          }
          else
          {
            FrstPass = true;
          }

          if (!CWsndengn.IsActv() || !CWsndengn.GetSOTflg())
          {
            if (FrstPass)
              ComputeMags(EvntStart); //"EvntStart" is the time stamp for this dataset
            curclr = ToneClr();       // Returns Sig level as calculated by Goetzel.cpp
            // printf("curclr: %d\n", curclr);
          } // else printf("%d\n", CWsndengn.GetState());//just for diagnostic testing
          /*The following is just for time/clock testing/veification */
          unsigned long sampleIntrvl = Now - ToneStart;
          ToneStart = Now;
          cur_smpl_rate = ((ret_num) * 250) / sampleIntrvl;
#ifdef POSTADC        
        }// end if(!skip)
#endif        
      }
      else if (ret == ESP_ERR_TIMEOUT)
      {
        // We try to read `ADC SAMPLEs/DATA` until API returns timeout, which means there's no available data
        /*JMH - This ocassionally happens; Why I'm not sure; But seems to recover & goes on with little fuss*/
        ESP_LOGI(TAG2, "BREAK from GoertzelHandler TASK");
        // break; //Commented out for esp32 decoder task
      }
      else
      {
        ESP_LOGI(TAG2, "NO ADC Data Returned");
      }

    } // end if(thread_notification)
  } // end while(1) loop
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  vTaskDelete(NULL);
}
///////////////////////////////////////////////////////////////////////////////////
/* DisplayUpDt Task; 
Collects data from events that happened in the last 33 ms & initiates a
Display update */
void DisplayUpDt(void *param)
{
  static uint32_t thread_notification;
  uint8_t state;
  // int QueueEmptyCnt = 0;
  int RxSig = 0;
  int CurSig = 0;
  while (1)
  {
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */
    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (thread_notification)
    {
      
      // if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE) // wait forever
      // {
      //   xSemaphoreGive(mutex);
      //   mutexFLG = false;
      // }
      // if (mutexFLG)
      int lpcnt = 0;
      while(mutexFLG){
        lpcnt++;
        
        vTaskDelay(pdMS_TO_TICKS(6));
      }
      if(lpcnt > 0) printf("%d. ERROR timer driven DisplayUpDt out of Sync\n", lpcnt);
      // if (mutex != NULL)
      // {
      /* See if we can obtain the semaphore.  If the semaphore is not
      available wait 10 ticks to see if it becomes free.
      note:  The macro pdMS_TO_TICKS() converts milliseconds to ticks */
      // bool tryagn = true;
      // while (tryagn)
      // {
      /*TODO verify that for LVGL (ShareWave Display) that this is needed;
      Don't think it is, since Sharewave is NOT a SPI based display*/
      // if (xSemaphoreTake(mutex, pdMS_TO_TICKS(100)) == pdTRUE)
      // {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      if (CWsndengn.UpDtWPM)
      {
        CWsndengn.UpDtWPM = false;
        CWsndengn.RefreshWPM();
      }
      RxSig = 0;
      int cnt = 0;
      bool readQueue = true;
      //sprintf(LogBuf,"DisplayUpDt Step 1 complete\n");
      /* get latest goertzel tone magnitude */
      while (readQueue)
      {
        readQueue = (xQueueReceive(RxSig_que, (void *)&CurSig, pdMS_TO_TICKS(3)) == pdTRUE);
        if (readQueue)
        {
          RxSig = CurSig;
          // printf("RxSig %d\n", RxSig);
        }

        // cnt++;
      }
      
      //sprintf(LogBuf,"DisplayUpDt Step 2 complete\n");
      /*make sure AdvanceParserTask isn't active before preceeding*/
      if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, pdMS_TO_TICKS(15)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
      {
        bool lpagn = true;
        while (lpagn) //(TickType_t)10
        {
          if (xQueueReceive(state_que, (void *)&state, pdMS_TO_TICKS(10)) == pdTRUE)
          {
            lvglmsgbx.IntrCrsr(state);
            //printf("state %d\n", state);
          }
          else
          {
           lpagn = false;
          }
        }
        lvglmsgbx.Str_KyBrdBat_level(bt_keyboard.get_battery_level());
        //sprintf(LogBuf,"DisplayUpDt Step 3 complete\n");
        /*update tone bar graph*/
        lvglmsgbx.dispMsg2(RxSig);
        //sprintf(LogBuf,"DisplayUpDt Step 4 complete\n");
        /* We have finished accessing the shared resource.  Release the
        semaphore. */
        xSemaphoreGive(DsplUpDt_AdvPrsrTsk_mutx);
      }
      QuequeFulFlg = false;
      //printf("Cur ADC Sample Rate: %d\n", cur_smpl_rate);// just for diagnostic testing
      bool HeapOK = heap_caps_check_integrity_all(true);
      if(!HeapOK)
      {
        printf("Heap ISSUE\n");
      }
    } // END if (thread_notification)
  } // end while(1) loop
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  printf("ERROR DisplayUpDt task DELETED\n");
  vTaskDelete(NULL);
}
///////////////////////////////////////////////////////////////////////////////////////
void ToneFreqTask(void *param)
{
  //uint8_t PeriodCntr;
  uint16_t _SmplCNt = 1;
  int _DemodFreq =0;
  while (1)
  {
    bool readQueue = true;
    while (readQueue)
    {
      readQueue = (xQueueReceive(ToneFrq_que, (void *)&_SmplCNt, pdMS_TO_TICKS(3)) == pdTRUE);
      if (readQueue)
      {
        _DemodFreq = (int)((float)40 * (float)SAMPLING_RATE) / (float)_SmplCNt;
        freq_int = _DemodFreq;// used in the scope view as current tone frequency
        if (_DemodFreq > 450)
        {
          // printf("_DemodFreq: %d;\tAvgToneFreq: %d\tTARGET_FREQUENCYC: %d;\tCurSendrFreq: %d\n", _DemodFreq, (uint16_t)AvgToneFreq, (uint16_t)TARGET_FREQUENCYC, (int)CurSendrFreq);
          /*20250211 reworked Sender changed & tone Frequency filter code*/
          if (abs(_DemodFreq - AvgToneFreq) < 3)
          {
            /*OK we got essentially the same freq twice in row, so it must be valid*/
            CalGtxlParamFlg = true;
            if (xSemaphoreTake(IIR_Coef_mutx, pdMS_TO_TICKS(3)) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
            {
              Calc_IIR_BPFltrCoef((float)AvgToneFreq, SAMPLING_RATE, 3.7071);
              xSemaphoreGive(IIR_Coef_mutx);
            }
            //Calc_IIR_BPFltrCoef((float)AvgToneFreq, SAMPLING_RATE, 3.7071);
          }
          else
          {
            // AvgToneFreq = _DemodFreq;
            AvgToneFreq = (int)((1 + (4 * AvgToneFreq + _DemodFreq) / 5));
          }
          /*Now test/check for sender change based on '_DemodFreq' freq change */
          if ((abs((int)CurSendrFreq - _DemodFreq) >= 7))
          {
            /*Check verify that new _DemodFreq value for consistentcy*/
            if (OutofBndCnt == 0)
            {
              OutOfBndFrq = _DemodFreq;
            }
            else if ((abs(OutOfBndFrq - _DemodFreq) > 4))
            { /*OutOfBndFrq reset*/
              OutOfBndFrq = _DemodFreq;
              OutofBndCnt = 0;
            }
            OutofBndCnt++;
            //printf("_DemodFreq: %d;\tCurSendrFreq: %d\tOutofBndCnt: %d\n", _DemodFreq, (uint16_t)CurSendrFreq, OutofBndCnt);

            if (OutofBndCnt >= 3)
            {
              OutofBndCnt = 0;
              CurSendrFreq = (float)_DemodFreq;//(float)AvgToneFreq;
              //intrglerr = 0.0; // reset error term
              /*if here, we just had a shift in the incoming tone of more than 15hz,
              so assume new 'sender', & force a wordbreak in the decoded text
              by setting the expected wordbreak time to 0 */
              NuSender = true;
              // printf("\t Nu Sender; CurSendrFreq: %d\n", (int)CurSendrFreq);
            }
          }
          else
          {
            OutofBndCnt = 0;
          }
          float tempval = ((float)AvgToneFreq - CurSendrFreq) / 100;
          if (tempval > 0.1)
            tempval = 0.1;
          if (tempval < -0.1)
            tempval = -0.1;
          CurSendrFreq = CurSendrFreq + tempval;
          // float tempval   = ((((11.0 *(float)CurSendrFreq) + (float)AvgToneFreq) / 12.0));
          // CurSendrFreq =(int)tempval;// add correction for current sender slow drift in freq
          // if((tempval - (float)CurSendrFreq) > 0.5) CurSendrFreq++;

