jmharvey1/ESP32S3_CW_Machine/src/main.cpp
        } // end if (_DemodFreq > 450)
      }
    }

    vTaskSuspend(ToneFreqTaskHandle);

  } // end while(1) loop
  vTaskDelete(NULL);
}
//////////////////////////////////////////////////////////////////////////////////////
/* CW Decoder Task; CW decoder main loop*/
void CWDecodeTask(void *param)
{
  static uint32_t thread_notification;
  static const char *TAG3 = "Decode Task";
  char Smpl[10];
  int sample;
  StartDecoder(&lvglmsgbx);
  while (1)
  {
    /* Sleep until we are notified of a state change by an
     * interrupt handler. Note the first parameter is pdTRUE,
     * which has the effect of clearing the task's notification
     * value back to 0, making the notification value act like
     * a binary (rather than a counting) semaphore.  */

    thread_notification = ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    if (thread_notification)
    {
      //printf("CWDecodeTask CoreID: %d\n", xPortGetCoreID());
      Dcodeloop();
      vTaskDelay(pdMS_TO_TICKS(2)); //this task under normal conditions runs all the time So insert a breather to allow Watchdog to reset
      //printf("CWDecodeTask complete\n");
      /* uncomment for diagnostic testing; graph ADC samples; Note: companion code in addSmpl(int k, int i, int *pCntrA) needs to be uncommented too */
      /* Pull accumulated "ADC sample" values from buffer & print to serial port*/
#ifdef POSTADC      
      if(!UrTurn){
        /* 
        uint32_t freq = 120*1000;//48*1000;
        uint32_t interval = APB_CLK_FREQ / (ADC_LL_CLKM_DIV_NUM_DEFAULT + ADC_LL_CLKM_DIV_A_DEFAULT / ADC_LL_CLKM_DIV_B_DEFAULT+1) /4 / freq;
        uint32_t Smpl_rate = 1000000/interval;
        char buf[40];
        sprintf(buf, "interval: %d; SmplRate: %d\n", (int)interval, (int)Smpl_rate);
        printf(buf);
        */
       if(bt_keyboard.PairFlg)
        for (int Smpl_CntrA = 0; Smpl_CntrA < 6 * Goertzel_SAMPLE_CNT; Smpl_CntrA++)
        {
          if(Smpl_buf[Smpl_CntrA] !=0){
            sprintf(Smpl, "%d\n", Smpl_buf[Smpl_CntrA]);
            printf(Smpl);
            
          }
        }
         UrTurn = true;
      }
#endif /* POSTADC */     
      /* END code for diagnostic testing; graph ADC samples; */
      
      xTaskNotifyGive(CWDecodeTaskHandle);
      
    }
    else if (ret == ESP_ERR_TIMEOUT)
    {
      ESP_LOGI(TAG3, "BREAK from CWDecodeTask TASK");
      break;
    }
    if(WokeFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      WokeFlg = false;
      printf("!!WOKE!!\n");
    }
    if(QuequeFulFlg){ //report void IRAM_ATTR DotClk_ISR(void *arg) result
      //QuequeFulFlg = false;
      char buf[40];
      sprintf(buf, "!!state QUEUE FULL!! %d\n", (int)QueFullstate);
      //printf(buf);
    }
  }
}
/*look for 'advertising' BLE keyboards
note: task remains active until one is found & 'paired'('PairFlg' is set to true)*/
void BLE_scan_tsk(void *param)
{
  const char *TAG2 = "BLE_scan_tsk";
  const char *TAG2A = "\nBLE_scan_tsk";
  //esp_log_level_set("*", ESP_LOG_DEBUG);
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  bool loop = true;
  SkippDotClkISR = true;
  while (loop)
  {
    bt_keyboard.PairFlg = false;
    ESP_LOGI(TAG2, "BLE SCAN - START");
    uint32_t EvntStart = pdTICKS_TO_MS(xTaskGetTickCount());
    uint16_t dev_scan_intrvl = 0;
    bt_keyboard.devices_scan(2); // Required to discover new keyboards and for pairing
                                 // Default duration is 3 seconds
    //while(dev_scan_intrvl<2000)
    //{
    //  dev_scan_intrvl = (uint16_t)(pdTICKS_TO_MS(xTaskGetTickCount()) - EvntStart);
    //}
    //ESP_LOGI(TAG2, "BLE SCAN - DONE (interval: %d)", dev_scan_intrvl);
    ESP_LOGI(TAG2, "BLE SCAN - DONE\n\n");
    if (bt_keyboard.GetPairFlg1())
    { 
      bt_keyboard.PairFlg = true;
      /*Clear/Erase Keyboard text area*/
      if (!DFault.DeBug)
      {
        Title[0] = 0xFF;
        Title[1] = 0x0;
        lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE); // clear send keyboard text area
      }
      sprintf(Title, "KEYBOARD READY\n");
      lvglmsgbx.dispKeyBrdTxt(Title, TFT_ORANGE);
      ESP_LOGI(TAG2, "Pairing Complete; KEYBOARD READY");
    }
    if (bt_keyboard.PairFlg)
    {
      //printf("EXIT SCAN\n");
      ESP_LOGI(TAG2, "EXIT SCAN");
      loop = false;
      // vTaskSuspend(NULL); // NULL = suspend this task
    }
  } // end while(loop)
  /** JMH Added this to ESP32 version to handle random crashing with error,"Task Goertzel Task should not return, Aborting now" */
  SkippDotClkISR = false;
  vTaskDelete(NULL);
}

///////////////////////////////////////////////////////////////////////////////////
/* AdvParserTask Task; Post Parser Code execution
*  Note: this task runs on core 1 
*/
void AdvParserTask(void *param)
{
  // static uint32_t thread_notification;// not used in AdvParserTask
  /*Used diagnose Advance parser CPU usage*/
  // UBaseType_t uxHighWaterMark;
  // unsigned long AdvPStart = 0;
  while (1)
  {
    /* Sleep until instructed to resume from DcodeCW.cpp */
    // printf("AdvParserTask Launched\n"); //added to verify task management

    BlkDcdUpDts = true;
    advparser.EvalTimeData();
    /*Now compare Advparser decoded text to original text; If not the same,
    replace displayed with Advparser version*/
    bool same = true;
    bool Tst4Match = true;
    int i;
    int FmtchPtr; // now only used for debugging
    /*Scan/compare last word displayed w/ advpaser's version*/
    int NuMsgLen = advparser.GetMsgLen();
    int LtrPtr = advparser.LtrPtr;
    wrdbrkFtcr = advparser.wrdbrkFtcr;
    if (NuMsgLen > LtrPtr || NuMsgLen < LtrPtr)
    { // if the advparser test string is longer, then delete the last word printed
      same = false;
      i = LtrPtr;
    }
    else
    {
      for (i = 0; i < LtrPtr; i++)
      {
        if (advparser.Msgbuf[i] == 0)
        {
          Tst4Match = false;
          break;
        }
        if ((advparser.LtrHoldr[i] != advparser.Msgbuf[i]) && Tst4Match)
        {
          FmtchPtr = i; // now only used for debugging
          same = false;
        }
        // if (advparser.LtrHoldr[i] == 0)
        //   break;
      }
    }

    /*If they don't match, replace displayed text with AdvParser's version*/
    int deletCnt = LtrPtr; // 0; // moved to here to support lvgl debugging
    int bufcharcnt = 0;
    char ringbuf[6];
    char spacemarker = 'Y';
    uint8_t LstChr = lvglmsgbx.GetLastChar();
    uint8_t OldLstChr;
    if (!same)
    {
      /*need to block display update task during this 'if()' code */
      if (xSemaphoreTake(DsplUpDt_AdvPrsrTsk_mutx, portMAX_DELAY) == pdTRUE) // pdMS_TO_TICKS()//portMAX_DELAY
      {
        bool abort = false;
#ifdef DeBgQueue
        printf("advparser.Msgbuf;'%s'; GetLastChar('%c') \n", advparser.Msgbuf, (char)LstChr);
#endif        
        OldLstChr = LstChr;
        /*Configure DCodeCW.cpp to erase/delete original text*/
        /*Add word break space to post parsed text*/
        char RingBufTst = 'T';
        /*returns true if the 2 buffer pointers are the same*/
         ringbuf[0] = ringbuf[1] = ringbuf[2] = ringbuf[3] = 0;
        while(bufcharcnt == 0)
        {
          if (!lvglmsgbx.TestRingBufPtrs())
          {
            bufcharcnt = lvglmsgbx.XferRingbuf(ringbuf);
            RingBufTst = 'F';
            #ifdef AutoCorrect 
            printf(" bufcharcnt:%d; ringbuf:'%s' \n", bufcharcnt, ringbuf);
            #endif
          }
          if (bufcharcnt == 0)
            vTaskDelay(pdMS_TO_TICKS(25));
        }
        LstChr = lvglmsgbx.GetLastChar();
        #ifdef AutoCorrect 
        if(LstChr != OldLstChr) printf("!!! LstChr:'%c' != OldLstChr:'%c'\n", LstChr, OldLstChr);
        #endif
        // advparser.Msgbuf[NuMsgLen] = 0x20; // 0x5f;//0x20;
        // advparser.Msgbuf[NuMsgLen + 1] = 0x0;
        char tmpbuf[30];
        //int OlddeletCnt = deletCnt;
        if (deletCnt > 0)
        {
          /*20250113 new method to find final/actual delete count*/
          if(bufcharcnt>1) deletCnt++;
          if(bufcharcnt == 1 && (LstChr != OldLstChr)) deletCnt++;
          /*End new find delete count method*/
          char DelStr[30];
          if (deletCnt > 29)
          {
            abort = true;
            deletCnt = 29;
            printf("\n deletCnt capped @ 29\n");
          }
          if(!abort)
          {
            for (int i = 0; i < deletCnt; i++)
            {
              DelStr[i] = 0x8;
            }
            DelStr[deletCnt] = 0x0;
            /*Now copy the new advparser character string/set to a temp buffer 'tmpbuf'*/
            int ptr = 0;
            while (advparser.Msgbuf[ptr] != 0 && ptr < 28)
            {
              tmpbuf[ptr] = advparser.Msgbuf[ptr];
              ptr++;
            }
            tmpbuf[ptr] = 0;
            /*reassemble 'Msgbuf' with new adparser character set prefixed with the number of deletes
             needed to remove the original text.
             Due to RTOS Variances in process sequencing/timing, there can be 3 different states in the Decoded text area
             ringbuffer the following 'if' code addresses each of the 3 cases
            */
            if (bufcharcnt == 1 && ringbuf[0] != ' ')
              sprintf(advparser.Msgbuf, "%s%s %s", DelStr, tmpbuf, ringbuf); // AdvParser running behind schedule
            else if (bufcharcnt > 1)
              sprintf(advparser.Msgbuf, "%s%s%s ", ringbuf, DelStr, tmpbuf); // AdvParser running faster than expected
            else
              sprintf(advparser.Msgbuf, "%s%s ", DelStr, tmpbuf); // normal/expected case
            /*for test/debug, show/print the before & after results*/
            // printf("old txt:%s;  new txt:%s\n\tdelete cnt: %d; advparser.LtrPtr %d; new txt length: %d; RingBufTst=%c; bufcharcnt: %d; ringbuf: %c%s%c; Space Corrected = %c(%d/%c%c%C) \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, ptr, RingBufTst, bufcharcnt, '"', ringbuf, '"', spacemarker, LstChr, '"', LstChr, '"');
          }
        }
        if(!abort)
        {
          if (advparser.Dbug)
            printf("old txt %s; new txt %s; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
#ifdef AutoCorrect
          printf("old txt %s; new txt %s; delete cnt %d; advparser.LtrPtr %d ; new txt length %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, tmpbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
#endif
          CptrTxt = false;
          lvglmsgbx.dispDeCdrTxt(advparser.Msgbuf, TFT_GREEN); // Added for lvgl; Note: color value is meaningless
          CptrTxt = true;
          // dletechar = oldDltState;
          /*now should be safe resume displayupdate task*/
        }
        xSemaphoreGive(DsplUpDt_AdvPrsrTsk_mutx);
      }
      // printf("old txt:%s;  new txt:%s; delete cnt: %d; advparser.LtrPtr: %d ; new txt length: %d; Space Corrected = %c/%d \n", advparser.LtrHoldr, advparser.Msgbuf, deletCnt, LtrPtr, NuMsgLen, spacemarker, LstChr);
    } // else printf("old txt: %s\n", advparser.LtrHoldr);

    if (advparser.Dbug)
      printf("%s\n", advparser.LtrHoldr);

