jmharvey1/ESP32S3_CW_Machine/src/main.cpp
/*Timer interrupt ISRs*/

void DsplTmr_callback(TimerHandle_t xtimer)
{
  // uint8_t state;
  // BaseType_t TaskWoke;
  BaseType_t xHigherPriorityTaskWoken = pdFALSE;
  vTaskNotifyGiveFromISR(DsplUpDtTaskHandle, &xHigherPriorityTaskWoken); // start DisplayUpDt Task
  if (xHigherPriorityTaskWoken == pdTRUE)
  {
      /*pdTRUE then a context switch should be performed to ensure 
      the interrupt returns directly to the highest priority task. */
      portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
      
  }
    if (QuequeFulFlg)
      {
        printf("DisplayUpDt timer Runing But Queque Reports FULL\n");
        printf(LogBuf);
        
      }
}
/*                                          */
/* DotClk timer ISR                 */
void IRAM_ATTR DotClk_ISR(void *arg)
{
  BaseType_t Woke;
  uint8_t state =0;
  if(SkippDotClkISR) return; //this will be true while BLE scan task is active
  
    state = CWsndengn.Intr(); // check CW send Engine & process as code as needed
                                      /* We have finished accessing the shared resource.  Release the semaphore. */
  
  if (state != 0)
  {
    vTaskSuspend(CWDecodeTaskHandle);
    clrbuf = true;
  }
  else
  {
    if (clrbuf)
    {
      clrbuf = false;
      CLrDCdValBuf(); // added this to ensure no DeCode Vals accumulate while the CWGen process is active; In other words the App doesn't decode itself
      vTaskResume(CWDecodeTaskHandle);
    }
  }
  /*Push returned "state" values on the que */
  if (xQueueSendFromISR(state_que, &state, &Woke) == pdFALSE)
  {
    QuequeFulFlg = true;
    QueFullstate = state;
  }
  if (Woke == pdTRUE)
    portYIELD_FROM_ISR(Woke);
  /*Woke == pdTRUE, if sending to the queue caused a task to unblock,
  and the unblocked task has a priority higher than the currently running task.
  If xQueueSendFromISR() sets this value to pdTRUE,
  then a context switch should be requested before the interrupt is exited.*/
  // WokeFlg = true;
}
///////////////////////////////////////////////////////////////////////////////////

/*This routine checks the current key entry; 1st looking for special key values that signify special handling,
if none found, it hands off the key entry to be treated as a standard CW character*/
void ProcsKeyEntry(uint8_t keyVal)
{
  bool addspce = false;
  char SpcChr = char(0x20);
  //printf("bufChar '%c'; Val_dec %d; Hex: %02x\n", (char)keyVal, (int)keyVal, keyVal);
  if (keyVal == 0x8)
  {                                  //"BACKSpace" key pressed
    int ChrCnt = CWsndengn.Delete(); // test to see if there's an "unsent" character that can be deleted
    if (ChrCnt > 0)
    {
      if (adcON && !CWsndengn.GetSOTflg()) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        // ESP_LOGI(TAG1, "!!!adc_continuous_stop!!!");
        ESP_ERROR_CHECK(adc_continuous_stop(adc_handle));
        printf("CASE 3\n");
        adcON = false;
        vTaskSuspend(GoertzelTaskHandle);
        // ESP_LOGI(TAG1, "SUSPEND GoertzelHandler TASK");
        // vTaskSuspend(CWDecodeTaskHandle);
        // ESP_LOGI(TAG1, "SUSPEND CWDecodeTaskHandle TASK");
      }
      if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE) // wait forever
      {
        /* We were able to obtain the semaphore and can now access the
        shared resource. */
        mutexFLG = true;
        /*TODO When Keyboard is enabled, this needs work*/
        //lvglmsgbx.Delete(false, ChrCnt);
        char DelChar[1];
			  DelChar[0]= 0x08;
        lvglmsgbx.dispKeyBrdTxt(DelChar, (uint16_t)0x00);//
        /* We have finished accessing the shared resource.  Release the
        semaphore. */
        xSemaphoreGive(mutex);
        mutexFLG = false;
      }
      if (!adcON) // added "if" just to make sure we're not gonna do something that doesn't need doing
      {
        // ESP_LOGI(TAG1, "***adc_continuous_start***");
        ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
        adcON = true;
        // ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
        // vTaskResume(CWDecodeTaskHandle);
        // ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
        vTaskResume(GoertzelTaskHandle);
      }
    }
    return;
  }
  else if (keyVal == 0x98)
  { // PG/arrow UP
    CWsndengn.IncWPM();
    DFault.WPM = CWsndengn.GetWPM();
    return;
  }
  else if (keyVal == 0x97)
  { // PG/arrow DOWN
    CWsndengn.DecWPM();
    DFault.WPM = CWsndengn.GetWPM();
    return;
  }
  else if (keyVal == 0x8C)
  { // F12 key (Alternate action SOT [Send On type])
    if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE)
    {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      mutexFLG = true;
      CWsndengn.SOTmode();
      /* We have finished accessing the shared resource.  Release the semaphore. */
      xSemaphoreGive(mutex);
      mutexFLG = false;
    }
    return;
  }
  else if (keyVal == 0x81)
  { // F1 key (store TEXT)
    if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE)
    {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      mutexFLG = true;
      CWsndengn.StrTxtmode();
      /* We have finished accessing the shared resource.  Release the semaphore. */
      xSemaphoreGive(mutex);
      mutexFLG = false;
    }
    return;
  }
  else if (keyVal == 0x82)
  { // F2 key (Send MemF2)
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(DFault.MemF2, sizeof(DFault.MemF2));
    return;
  }
  else if (keyVal == 0x83)
  { // F3 key (Send MemF3)
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(DFault.MemF3, sizeof(DFault.MemF3));
    return;
  }
  else if (keyVal == 0x84)
  { // F4 key (Send MemF4)
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(DFault.MemF4, sizeof(DFault.MemF4));
    return;
  }
  else if (keyVal == 0x85)
  { // F5 key (Send MemF5)
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(DFault.MemF5, sizeof(DFault.MemF5));
    return;
  }
  else if (keyVal == 0x95)
  { // Right Arrow Key (Alternate action SOT [Send On type])
  if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE)
    {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      mutexFLG = true;
    CWsndengn.SOTmode();
    /* We have finished accessing the shared resource.  Release the semaphore. */
      xSemaphoreGive(mutex);
      mutexFLG = false;
    }
    return;
  }
  else if (keyVal == 0x96)
  { // Left Arrow Key (store TEXT)
  if (xSemaphoreTake(mutex, portMAX_DELAY) == pdTRUE)
    {
      /* We were able to obtain the semaphore and can now access the
      shared resource. */
      mutexFLG = true;
    CWsndengn.StrTxtmode();
    /* We have finished accessing the shared resource.  Release the semaphore. */
      xSemaphoreGive(mutex);
      mutexFLG = false;
    }
    return;
  }
  else if (keyVal == 0x1B)
  { // ESC key (Kill Send)
    CWsndengn.AbortSnd();
    return;
  }
  else if ((keyVal == 0x9B))
  { // Cntrl+"T"
    CWsndengn.Tune();
    return;
  }
  else if ((keyVal == 0x9C))
  { // Cntrl+"S"
    setupFlg = !setupFlg;
    return;
  }
  else if ((keyVal == 0x87))
  { // "F7" - Clear Decode Text Area Space
    lvglmsgbx.ClrDcdTA();
    return;
  }
  else if ((keyVal == 0x88))
  { // "F8"
    NiteMode = !NiteMode;
    DFault.NiteMode = NiteMode;
    lvglmsgbx.FlipDayNiteMode();
    return;
  }
  else if ((keyVal == 0x89))
  { // "F9"
    ScopeFlg = !ScopeFlg;
    return;
  }
  else if ((keyVal == 0x9D))
  { // Cntrl+"F"; auto-tune/ freqLocked
    AutoTune = !AutoTune;
    DFault.AutoTune = AutoTune;
    vTaskDelay(20);
    showSpeed();
    vTaskDelay(250);
    return;
  }
  else if ((keyVal == 0xA1))
  { // Cntrl+"G"; Sample interval 4ms / 8ms
    // int GainCnt =0;
    // if(NoisFlg) GainCnt = 2;
    // if(SlwFlg && !NoisFlg) GainCnt = 1;
    //   GainCnt++;
    // if (GainCnt > 1)  GainCnt = 0;//20231029 decided that the 3rd gain mode was no longer needed, so locked it out
    //   switch(GainCnt){
    // case 0:
    //   SlwFlg = false;
    //   NoisFlg = false;
    //   break;
    // case 1:
    //   SlwFlg = true;
    //   NoisFlg = false;
    //   break;
    // case 2:
    //   SlwFlg = true;
    //   NoisFlg = true;
    //   break;
    /*20240123 Changed So that Ctrl+G now Enables/Disables Debug */
    if (DeBug)
    {
      DeBug = false;
      DFault.DeBug = false;
    }
    else
    {
      DeBug = true;
      DFault.DeBug = true;
    }
    return;
  }
  /*20240123 Disabled Ctrl+D function; replaced by AdvParser Class & methods*/
  // else if ((keyVal == 0x9E))
  // { // LEFT Cntrl+"D"; Decode Modef()

  //     /*Normal setup */
  //     ModeCnt++;
  //     if (ModeCnt > 3)
  //     ModeCnt = 0;
  //     DFault.ModeCnt = ModeCnt;
  //     SetModFlgs(ModeCnt);
  //     CurMdStng(ModeCnt);//added 20230104
  //     vTaskDelay(20);
  //     showSpeed();
  //     vTaskDelay(250);
  //     return;
  // }
  else if ((keyVal == 0xA0))
  { // RIGHT Cntrl+"D"; Decode Modef()

