jmharvey1/ESP32S3_CW_Machine/src/main.cpp
    /*Normal setup */
    // if (ModeCnt == 4)
    // {
    //   ESP_LOGI(TAG1, "RESUME CWDecodeTaskHandle TASK");
    //   vTaskResume(CWDecodeTaskHandle);
    //   ESP_LOGI(TAG1, "RESUME GoertzelHandler TASK");
    //   vTaskResume(GoertzelTaskHandle);
    //   ESP_ERROR_CHECK(adc_continuous_start(adc_handle));
    //   adcON =true;
    //   vTaskDelay(20);
    // }
    ModeCnt--;
    if (ModeCnt < 0)
      ModeCnt = 3;
    DFault.ModeCnt = ModeCnt;
    SetModFlgs(ModeCnt);
    CurMdStng(ModeCnt); // added 20230104
    vTaskDelay(20);
    showSpeed();
    vTaskDelay(250);
    return;
  }
  else if ((keyVal == 0x9F))
  { // Cntrl+"P"; CW decode ADC plot Enable/Disable
    PlotFlg = !PlotFlg;
    if(PlotFlg) printf("ToneThresHold\tCurLvl\tNoiseFlr\tKeyState\tNFkeystate\tAvgNoise\tcurNois\n"); //ltrCmplt
    // DFault.AutoTune = AutoTune;
    vTaskDelay(250);
    return;
  }
  else if ((keyVal == 0xD))
  { // "ENTER" Key send myCallSign
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(DFault.MyCall, sizeof(DFault.MyCall));
    return;
  }
  else if ((keyVal == 0x9A))
  { // "Cntrl+ENTER" send StrdTxt call
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    CWsndengn.LdMsg(StrdTxt, 20);
    return;
  }
  else if ((keyVal == 0x99))
  { // "shift+ENTER" send both calls (StrdTxt & MyCall)
    if (CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
      CWsndengn.AddNewChar(&SpcChr);
    // char buf[20]="";
    sprintf(Title, "%s DE %s", StrdTxt, DFault.MyCall);
    CWsndengn.LdMsg(Title, 20);
    return;
  }
  // else if ((keyVal ==  0xA1))
  // { /* special test for Left ctr+'g'
  //   reduce Goertzel gain*/
  //   Grtzl_Gain = Grtzl_Gain/2;
  //   if (Grtzl_Gain < 0.00390625) Grtzl_Gain  = 0.00390625;
  //   DFault.Grtzl_Gain = Grtzl_Gain;
  //   return;
  // }
  // else if ((keyVal ==  0xA2))
  // { /* special test for Right ctr+'g'
  //   increase Goertzel gain*/
  //   Grtzl_Gain = 2* Grtzl_Gain;
  //   if (Grtzl_Gain > 1.0) Grtzl_Gain  = 1.0;
  //   DFault.Grtzl_Gain = Grtzl_Gain;
  //   return;
  // }
  if ((keyVal >= 97) & (keyVal <= 122))
  {
    keyVal = keyVal - 32;
  }
  char Ltr2Bsent = (char)keyVal;
  switch (Ltr2Bsent)
  {
  case '=':
    addspce = true; //<BT>
    break;
  case '+':
    addspce = true; //<KN>
    break;
  case '%':
    addspce = true;
    ; //<SK>
    break;
  case '>':
    addspce = true; //<BT>
    break;
  case '<':
    addspce = true; //<BT>
    break;
  }
  if (addspce && CWsndengn.IsActv() && !CWsndengn.LstNtrySpc())
    CWsndengn.AddNewChar(&SpcChr);
  CWsndengn.AddNewChar(&Ltr2Bsent);
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void SettingsLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 10;
  bool FocusChngd = false;
  int oldparamPtr = 0;
  lvglmsgbx.HiLite_Seltcd_Setting(paramPtr, oldparamPtr);
  
  while (setupFlg)
  {
    vTaskDelay(pdMS_TO_TICKS(100));
    // printf("while(setupFlg)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x9C) //= "crtl+s"
    {
      /*user wants to exit setting screen
      So 1st pass the current sttetings entries back to their respective DFault parameters*/
      lvglmsgbx.syncDfltwSettings();
      CWsndengn.SetWPM(DFault.WPM);//syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      setupFlg = false;
    }
    else if (key == 0x98)
    { // Arrow UP
      key = 0;
      //NtryBoxGrp[paramPtr].KillCsr();
      oldparamPtr = paramPtr;
      paramPtr--;
      FocusChngd = true;
    }
    else if (key == 0x97)
    { // Arrow DOWN
      key = 0;
      //NtryBoxGrp[paramPtr].KillCsr();
      oldparamPtr = paramPtr;
      paramPtr++;
      FocusChngd = true;
    }
    if (paramPtr == paramCnt)
      paramPtr = 0;
    if (paramPtr < 0)
      paramPtr = paramCnt - 1;
    if(FocusChngd)
    {
      lvglmsgbx.HiLite_Seltcd_Setting(paramPtr, oldparamPtr);
      FocusChngd = false;
    }  
    else if (key != 0)
    {
      lvglmsgbx.KBentry(key, paramPtr);
    }
    if (!setupFlg)
    {
      lvglmsgbx.Exit_Settings(paramPtr);
      lvglmsgbx.ReStrtMainScrn();
    }
  }
};

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void ScopeLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 9;
  bool FocusChngd = false;
  int oldparamPtr = 0;
  ScopeActive = true;
  while (ScopeFlg)
  {
    vTaskDelay(pdMS_TO_TICKS(100));
    //printf("while(ScopeLoop)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x89) //= "F9"
    {
      /*user wants to exit Scope screen*/
      CWsndengn.SetWPM(DFault.WPM);//syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      ScopeActive = false;
      ScopeFlg = false;
    }
    
  }
  lvglmsgbx.ReStrtMainScrn();
  vTaskDelay(pdMS_TO_TICKS(25));
};
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void HelpLoop(void)
{
  int paramPtr = 0;
  int paramCnt = 9;
  bool FocusChngd = false;
  int oldparamPtr = 0;
  ScopeActive = true;
  while (HelpFlg)
  {
    vTaskDelay(pdMS_TO_TICKS(100));
    //printf("while(ScopeLoop)\n");
    uint8_t key = bt_keyboard.wait_for_ascii_char(false);
    if (key == 0x89) //= "F9"
    {
      /*user wants to exit Help screen*/
      CWsndengn.SetWPM(DFault.WPM);//syncDfltwSettings could have updated/changed the WPM setting so we need to make sure the send engine has the latest
      //ScopeActive = false;
      HelpFlg = false;
    }
  }
  lvglmsgbx.ReStrtMainScrn();
  vTaskDelay(pdMS_TO_TICKS(25));
};
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

/* the following code handles the read from & write to NVS processes needed to handle the User CW prefences/settings  */

